{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Reference list summarizing many frontend files and their roles in the simulator.",
  "frontend/index.css": "Tailwind-based global style sheet defining color variables and base theming.",
  "frontend/index.html": "Basic HTML template mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Renders the FlightSimView component as the app root.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing a backend actor tied to Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, storage, and lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder module for potential data fetching hooks.",
  "frontend/src/index.css": "Tailwind styles with aviation-themed palette and HUD component classes.",
  "frontend/src/lib/googleMapsConfig.ts": "Empty module placeholder for Google Maps config utilities.",
  "frontend/src/main.tsx": "Bootstraps React, sets up providers, and mounts the app.",
  "frontend/src/sim/camera/ChaseCameraRig.tsx": "Smooth chase camera that follows a target group with offset and look-at logic.",
  "frontend/src/sim/controls/useFlightControls.ts": "Hook that tracks keyboard input and outputs normalized pitch, roll, yaw, and throttle values updated every 16ms.",
  "frontend/src/sim/FlightSimView.tsx": "Main simulator view wiring Canvas, scene, HUD, and UI overlays to sim state.",
  "frontend/src/sim/hud/FlightHUD.tsx": "Renders on‑screen HUD panels showing speed, altitude, heading, throttle, and position from the sim state.",
  "frontend/src/sim/hud/format.ts": "Provides small formatting helpers for speed, altitude, heading, throttle, and latitude/longitude display.",
  "frontend/src/sim/maps/googleMaps.ts": "Empty placeholder for Google Maps integration.",
  "frontend/src/sim/maps/useMapTexture.ts": "Empty placeholder hook for map texture handling.",
  "frontend/src/sim/physics/useSimpleFlightModel.ts": "Implements a simple physics model updating aircraft movement, rotation, throttle, and geolocation each frame.",
  "frontend/src/sim/scene/FlightScene.tsx": "Three.js scene combining controls, physics, plane model, procedural world, and chase camera.",
  "frontend/src/sim/scene/MapGround.tsx": "Empty placeholder for map‑based ground rendering.",
  "frontend/src/sim/scene/ProceduralWorld.tsx": "Manages loading, generating, and disposing terrain and building chunks around the aircraft based on position and seed.",
  "frontend/src/sim/state/types.ts": "Defines the SimState interface for aircraft physics, world position, and procedural seed values.",
  "frontend/src/sim/state/useSimState.ts": "Hook managing sim state, run/reset controls, and random world seed generation.",
  "frontend/src/sim/ui/SimControlsBar.tsx": "UI bar showing control instructions and a reset button.",
  "frontend/src/sim/ui/StartOverlay.tsx": "Start screen overlay with controls guide and button to begin the simulation.",
  "frontend/src/sim/world/buildings.ts": "Generates deterministic building instances per terrain chunk using seeded randomness and creates Three.js meshes for them.",
  "frontend/src/sim/world/noise.ts": "Implements basic 2D value noise and FBM functions used for terrain height generation.",
  "frontend/src/sim/world/prng.ts": "Provides a seeded pseudo-random generator and a coordinate hashing function for deterministic world generation.",
  "frontend/src/sim/world/terrain.ts": "Generates terrain chunk meshes using FBM noise, applies height-based vertex coloring, and exposes helpers for chunk keys and height sampling.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the app’s UI styling.",
  "project_state.json": "Defines the project’s metadata, feature list, and procedural-world simulation context for the 3D flight app."
}